#TODO сделать импорт названий файлов из всех папок корневой папки для моментального разбиения книг по группам
#TODO сделать возможность сразу все файлы обрабатывать разом
#TODO научить код анализировать сразу пачки файлов, а не два
#TODO сделать код ООП шным
#TODO оптимизировать код, чтобы работал быстрее и выглядел чище
#TODO попробуй написать этот же код полностью через дипсик например, что у него получится
#TODO подключить api переводчика и переводить все слова сразу при записи в файл
#TODO сделать простецкий веб интерфейс для отображения всех датасетов по категориям на сайте
#TODO попробовать попросить нейронку переписать код на C++, мб работать будет быстрее, просто что-бы не ждать долго слишком при большом наборе данных
#TODO научить работать с дежавю файлами и другими типами файлов
#TODO можно будет на сайте сделать возможность выбирать свою книгу, чтобы человек мог собственный датасет собрать
#TODO добавить статистику анализа, сколько слов по факту, сколько книг, что чего и т.д.
#TODO надо бы подключить базу данных для экономии оперативки и постоянного хранения в бд, а не в файлах, так лучше, быстрее и удобнее
#TODO нужно переделать функцию конвертации pdf->txt, хуево работает, теряет пробелы, это самое главное ведь для меня, мусор можно очистить, а пробелы я никак не добавлю
#TODO print_all_files_from_rootdir и все с ним связанное должно работать для любой вложенности, ну или хотя-бы для вложенности > 2
